Revit 2026 API

# BRepBuilderPersistentIds Properties

---

The BRepBuilderPersistentIds type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

#### Reference

BRepBuilderPersistentIds Class

Autodesk.Revit.DB Namespace